feat: updated verifiability docs
Signed-off-by: Abhishek Kumar Phutane <abhishek@rainminds.com>
